let result = [];
for (let number = 1; number <= 100; number++) {
  if (number %3 === 0) {
    result.push("3の倍数です");
  } else {
    result.push(number);
  }
}

console.log(result);

/*
出力結果↓
[
  1,             2,             '3の倍数です', 4,             5,
  '3の倍数です', 7,             8,             '3の倍数です', 10,
  11,            '3の倍数です', 13,            14,            '3の倍数です',
  16,            17,            '3の倍数です', 19,            20,
  '3の倍数です', 22,            23,            '3の倍数です', 25,
  26,            '3の倍数です', 28,            29,            '3の倍数です',
  31,            32,            '3の倍数です', 34,            35,
  '3の倍数です', 37,            38,            '3の倍数です', 40,
  41,            '3の倍数です', 43,            44,            '3の倍数です',
  46,            47,            '3の倍数です', 49,            50,
  '3の倍数です', 52,            53,            '3の倍数です', 55,
  56,            '3の倍数です', 58,            59,            '3の倍数です',
  61,            62,            '3の倍数です', 64,            65,
  '3の倍数です', 67,            68,            '3の倍数です', 70,
  71,            '3の倍数です', 73,            74,            '3の倍数です',
  76,            77,            '3の倍数です', 79,            80,
  '3の倍数です', 82,            83,            '3の倍数です', 85,
  86,            '3の倍数です', 88,            89,            '3の倍数です',
  91,            92,            '3の倍数です', 94,            95,
  '3の倍数です', 97,            98,            '3の倍数です', 100
]
*/
